; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-7-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-6 - location
	p0-7 - location
	p1-5 - location
	p2-3 - location
	p2-7 - location
	p3-1 - location
	p4-3 - location
	p4-9 - location
	p5-0 - location
	p5-3 - location
	p6-2 - location
	p6-5 - location
	p6-9 - location
	p7-1 - location
	p7-4 - location
	p8-0 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s3)
	(at driver3 s6)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s7)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s0)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s2)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s1)
	(at package2 s4)
	(at package3 s2)
	(at package4 s1)
	(at package5 s8)
	(at package6 s8)
	(at package7 s8)
	(at package8 s2)
	(at package9 s1)
	(at package10 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 68)
	(= (time-to-drive s2 s0) 68)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 75)
	(= (time-to-drive s0 s1) 75)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 83)
	(= (time-to-drive s2 s1) 83)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 85)
	(= (time-to-drive s9 s1) 85)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 38)
	(= (time-to-drive s4 s2) 38)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 62)
	(= (time-to-drive s9 s2) 62)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 75)
	(= (time-to-drive s7 s3) 75)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 12)
	(= (time-to-drive s0 s4) 12)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 59)
	(= (time-to-drive s1 s4) 59)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 39)
	(= (time-to-drive s7 s4) 39)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 70)
	(= (time-to-drive s1 s5) 70)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 84)
	(= (time-to-drive s2 s5) 84)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 85)
	(= (time-to-drive s3 s5) 85)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 9)
	(= (time-to-drive s7 s5) 9)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 73)
	(= (time-to-drive s0 s6) 73)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 13)
	(= (time-to-drive s1 s6) 13)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 39)
	(= (time-to-drive s5 s6) 39)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 33)
	(= (time-to-drive s2 s8) 33)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 32)
	(= (time-to-drive s5 s8) 32)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 93)
	(= (time-to-drive s6 s8) 93)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 42)
	(= (time-to-drive s3 s9) 42)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 56)
	(= (time-to-drive s5 s9) 56)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 58)
	(= (time-to-drive s6 s9) 58)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 100)
	(= (time-to-drive s7 s9) 100)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 21)
	(= (time-to-drive s8 s9) 21)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s9)
	(at driver3 s2)
	(at truck1 s0)
	(at truck2 s0)
	(at truck4 s0)
	(at truck5 s1)
	(at truck7 s3)
	(at package1 s8)
	(at package2 s2)
	(at package3 s9)
	(at package4 s1)
	(at package5 s2)
	(at package6 s6)
	(at package7 s7)
	(at package8 s4)
	(at package9 s5)
	(at package10 s7)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 17
2. (drive-truck truck3 s3 s7 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (fuel-used) from 0 to 750
   goals met: 2 of 17
3. (walk driver3 s6 p6-2)
   deleted: (at driver3 s6)
   added: (at driver3 p6-2)
   goals met: 2 of 17
4. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   goals met: 2 of 17
5. (walk driver3 p6-2 s2)
   deleted: (at driver3 p6-2)
   added: (at driver3 s2)
   goals met: 3 of 17
6. (board-truck driver3 truck7 s2)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 2 of 17
7. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 2 of 17
8. (board-truck driver2 truck5 s7)
   deleted: (at driver2 s7) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 2 of 17
9. (load-truck package3 truck7 s2)
   deleted: (at package3 s2)
   added: (in package3 truck7)
   changed: (load truck7) from 0 to 1, (fuel-per-minute truck7) from 10 to 11
   goals met: 2 of 17
10. (load-truck package8 truck7 s2)
   deleted: (at package8 s2)
   added: (in package8 truck7)
   changed: (load truck7) from 1 to 2, (fuel-per-minute truck7) from 11 to 13
   goals met: 2 of 17
11. (load-truck package10 truck7 s2)
   deleted: (at package10 s2)
   added: (in package10 truck7)
   changed: (load truck7) from 2 to 3, (fuel-per-minute truck7) from 13 to 16
   goals met: 2 of 17
12. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   goals met: 2 of 17
13. (load-truck package9 truck2 s1)
   deleted: (at package9 s1)
   added: (in package9 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 17
14. (drive-truck truck7 s2 s8 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s8)
   changed: (fuel-used) from 750 to 1278
   goals met: 2 of 17
15. (load-truck package5 truck7 s8)
   deleted: (at package5 s8)
   added: (in package5 truck7)
   changed: (load truck7) from 3 to 4, (fuel-per-minute truck7) from 16 to 20
   goals met: 2 of 17
16. (drive-truck truck7 s8 s2 driver3)
   deleted: (at truck7 s8)
   added: (at truck7 s2)
   changed: (fuel-used) from 1278 to 1938
   goals met: 2 of 17
17. (unload-truck package5 truck7 s2)
   deleted: (in package5 truck7)
   added: (at package5 s2)
   changed: (load truck7) from 4 to 3, (fuel-per-minute truck7) from 20 to 16
   goals met: 3 of 17
18. (drive-truck truck7 s2 s8 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s8)
   changed: (fuel-used) from 1938 to 2466
   goals met: 3 of 17
19. (load-truck package6 truck7 s8)
   deleted: (at package6 s8)
   added: (in package6 truck7)
   changed: (load truck7) from 3 to 4, (fuel-per-minute truck7) from 16 to 20
   goals met: 3 of 17
20. (load-truck package7 truck7 s8)
   deleted: (at package7 s8)
   added: (in package7 truck7)
   changed: (load truck7) from 4 to 5, (fuel-per-minute truck7) from 20 to 25
   goals met: 3 of 17
21. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 17
22. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 17
23. (drive-truck truck5 s7 s9 driver2)
   deleted: (at truck5 s7)
   added: (at truck5 s9)
   changed: (fuel-used) from 2466 to 3466
   goals met: 3 of 17
24. (disembark-truck driver2 truck5 s9)
   deleted: (driving driver2 truck5)
   added: (at driver2 s9) (empty truck5)
   goals met: 4 of 17
25. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 3466 to 4233
   goals met: 4 of 17
26. (drive-truck truck7 s8 s9 driver3)
   deleted: (at truck7 s8)
   added: (at truck7 s9)
   changed: (fuel-used) from 4233 to 4758
   goals met: 4 of 17
27. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 17
28. (unload-truck package3 truck7 s9)
   deleted: (in package3 truck7)
   added: (at package3 s9)
   changed: (load truck7) from 5 to 4, (fuel-per-minute truck7) from 25 to 20
   goals met: 5 of 17
29. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 4758 to 5366
   goals met: 5 of 17
30. (unload-truck package2 truck2 s2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 6 of 17
31. (drive-truck truck7 s9 s2 driver3)
   deleted: (at truck7 s9)
   added: (at truck7 s2)
   changed: (fuel-used) from 5366 to 6606
   goals met: 6 of 17
32. (drive-truck truck7 s2 s4 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s4)
   changed: (fuel-used) from 6606 to 7366
   goals met: 6 of 17
33. (unload-truck package8 truck7 s4)
   deleted: (in package8 truck7)
   added: (at package8 s4)
   changed: (load truck7) from 4 to 3, (fuel-per-minute truck7) from 20 to 16
   goals met: 7 of 17
34. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 7366 to 8458
   goals met: 7 of 17
35. (unload-truck package9 truck2 s5)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 17
36. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 8458 to 8887
   goals met: 8 of 17
37. (drive-truck truck7 s4 s2 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s2)
   changed: (fuel-used) from 8887 to 9495
   goals met: 8 of 17
38. (drive-truck truck7 s2 s5 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s5)
   changed: (fuel-used) from 9495 to 10839
   goals met: 8 of 17
39. (drive-truck truck2 s6 s8 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (fuel-used) from 10839 to 11862
   goals met: 8 of 17
40. (unload-truck package1 truck2 s8)
   deleted: (in package1 truck2)
   added: (at package1 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 17
41. (drive-truck truck2 s8 s6 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (fuel-used) from 11862 to 12792
   goals met: 9 of 17
42. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 12792 to 13522
   goals met: 10 of 17
43. (board-truck driver2 truck5 s9)
   deleted: (at driver2 s9) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 9 of 17
44. (drive-truck truck5 s9 s1 driver2)
   deleted: (at truck5 s9)
   added: (at truck5 s1)
   changed: (fuel-used) from 13522 to 14372
   goals met: 10 of 17
45. (drive-truck truck7 s5 s6 driver3)
   deleted: (at truck7 s5)
   added: (at truck7 s6)
   changed: (fuel-used) from 14372 to 14996
   goals met: 10 of 17
46. (unload-truck package6 truck7 s6)
   deleted: (in package6 truck7)
   added: (at package6 s6)
   changed: (load truck7) from 3 to 2, (fuel-per-minute truck7) from 16 to 13
   goals met: 11 of 17
47. (drive-truck truck7 s6 s9 driver3)
   deleted: (at truck7 s6)
   added: (at truck7 s9)
   changed: (fuel-used) from 14996 to 15750
   goals met: 11 of 17
48. (drive-truck truck7 s9 s7 driver3)
   deleted: (at truck7 s9)
   added: (at truck7 s7)
   changed: (fuel-used) from 15750 to 17050
   goals met: 11 of 17
49. (unload-truck package7 truck7 s7)
   deleted: (in package7 truck7)
   added: (at package7 s7)
   changed: (load truck7) from 2 to 1, (fuel-per-minute truck7) from 13 to 11
   goals met: 12 of 17
50. (unload-truck package10 truck7 s7)
   deleted: (in package10 truck7)
   added: (at package10 s7)
   changed: (load truck7) from 1 to 0, (fuel-per-minute truck7) from 11 to 10
   goals met: 13 of 17
51. (drive-truck truck7 s7 s3 driver3)
   deleted: (at truck7 s7)
   added: (at truck7 s3)
   changed: (fuel-used) from 17050 to 17800
   goals met: 14 of 17
52. (drive-truck truck7 s3 s9 driver3)
   deleted: (at truck7 s3)
   added: (at truck7 s9)
   changed: (fuel-used) from 17800 to 18220
   goals met: 13 of 17
53. (drive-truck truck5 s1 s9 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s9)
   changed: (fuel-used) from 18220 to 19070
   goals met: 12 of 17
54. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 19070 to 19750
   goals met: 11 of 17
55. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 11 of 17
56. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 11 of 17
57. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 19750 to 20430
   goals met: 12 of 17
58. (drive-truck truck7 s9 s2 driver3)
   deleted: (at truck7 s9)
   added: (at truck7 s2)
   changed: (fuel-used) from 20430 to 21050
   goals met: 12 of 17
59. (drive-truck truck7 s2 s5 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s5)
   changed: (fuel-used) from 21050 to 21890
   goals met: 12 of 17
60. (drive-truck truck5 s9 s1 driver2)
   deleted: (at truck5 s9)
   added: (at truck5 s1)
   changed: (fuel-used) from 21890 to 22740
   goals met: 13 of 17
61. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 22740 to 23570
   goals met: 12 of 17
62. (drive-truck truck7 s5 s2 driver3)
   deleted: (at truck7 s5)
   added: (at truck7 s2)
   changed: (fuel-used) from 23570 to 24410
   goals met: 12 of 17
63. (drive-truck truck7 s2 s9 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s9)
   changed: (fuel-used) from 24410 to 25030
   goals met: 12 of 17
64. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 12 of 17
65. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 17
66. (drive-truck truck7 s9 s3 driver3)
   deleted: (at truck7 s9)
   added: (at truck7 s3)
   changed: (fuel-used) from 25030 to 25450
   goals met: 13 of 17
67. (disembark-truck driver3 truck7 s3)
   deleted: (driving driver3 truck7)
   added: (at driver3 s3) (empty truck7)
   goals met: 13 of 17
68. (walk driver3 s3 p2-3)
   deleted: (at driver3 s3)
   added: (at driver3 p2-3)
   goals met: 13 of 17
69. (walk driver3 p2-3 s2)
   deleted: (at driver3 p2-3)
   added: (at driver3 s2)
   goals met: 14 of 17
70. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 25450 to 26130
   goals met: 15 of 17
71. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 15 of 17
72. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 15 of 17
73. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 14 of 17
74. (drive-truck truck5 s2 s0 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 26130 to 26810
   goals met: 14 of 17
75. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 14 of 17
76. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 14 of 17
77. (walk driver2 s0 p0-6)
   deleted: (at driver2 s0)
   added: (at driver2 p0-6)
   goals met: 14 of 17
78. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 15 of 17
79. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 15 of 17
80. (drive-truck truck5 s0 s1 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 26810 to 27560
   goals met: 16 of 17
81. (walk driver2 p0-6 s6)
   deleted: (at driver2 p0-6)
   added: (at driver2 s6)
   goals met: 16 of 17
82. (walk driver2 s6 p6-9)
   deleted: (at driver2 s6)
   added: (at driver2 p6-9)
   goals met: 16 of 17
83. (walk driver2 p6-9 s9)
   deleted: (at driver2 p6-9)
   added: (at driver2 s9)
   goals met: 17 of 17
